package com.example.mymathlibrary.Dicts;

import java.util.ArrayList;
import java.util.List;

public class Tasks {
    public static List<String> taskList = new ArrayList<String>() {{
        add("Задача 1");
        add("Задача 2");
        add("Задача 3");
        add("Задача 4");
        add("Задача 5");
        add("Задача 6");
        add("Задача 7");
        add("Задача 8");
        add("Задача 9");
        add("Задача 10");
        add("Задача 11");
        add("Задача 12");
    }};
    public static List<String> taskDef = new ArrayList<String>() {{
        add("Точка — это геометрическая фигура, не имеющая размеров.");
        add("В правильной треугольной пирамиде SABC сторона основания АВ равна 16, высота SH равна 10.Точка К — середина бокового ребра SA. Плоскость, параллельная плоскости АВС, проходит через точку К и пересекает рёбра SB и SC в точках Q и Р соответственно.\n" +
                "а) Докажите, что площадь четырёхугольника BCPQ составляет —\n" +
                "треугольника SBC.\n" +
                "б) Найдите объём пирамиды KBCPQ");
        add("Каждый отрезок получается так: на прямой берут две точки А и В (рис. 12). Их называют концами отрезка. Сам же отрезок состоит из этих выделенных точек А и В и всех точек прямой, лежащих между ними.");
        add("Любая точка О прямой разделяет ее на две части (рис. 10). Каждая из этих частей называется лучом, исходящим из точки О — начала луча. ");
        add("Угол - это геометрическая фигура, состоящая из точки и двух лучей, исходящих из этой точки.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
        add("Любая прямая разделяет плоскость на две части, каждая из которых называется полуплоскостью, а сама прямая служит границей этих полуплоскостей.");
    }};
    public static List<String> taskImago = new ArrayList<String>() {{
        add("legend");
        add("piro");
        add("cut_def");
        add("ray_def");
        add("angle_def");
        add("halfflat_def");
        add("halfflat_def");
        add("halfflat_def");
        add("halfflat_def");
        add("halfflat_def");
        add("halfflat_def");
        add("halfflat_def");
    }};
    public static List<String> taskFilter = new ArrayList<String>() {{
        add("0");
        add("13");
        add("12");
        add("03");
        add("14");
        add("023");
        add("023");
        add("03");
        add("123");
        add("03");
        add("023");
        add("0235");
    }};
    public static List<String> taskAnswers = new ArrayList<String>() {{
        add("0");
        add("3");
        add("2");
        add("3");
        add("4");
        add("5");
        add("5");
        add("5");
        add("5");
        add("5");
        add("5");
        add("5");
    }};
}