package com.example.mymathlibrary.Dicts;

import java.util.ArrayList;
import java.util.List;

public class Tasks {
    public static List<String> taskList = new ArrayList<String>() {{
        add("Задача 1");
        add("Задача 2");
        add("Задача 3");
        add("Задача 4");
        add("Задача 5");
        add("Задача 6");
        add("Задача 7");
        add("Задача 8");
        add("Задача 9");
        add("Задача 10");
        add("Задача 11");
        add("Задача 12");
    }};
    public static List<String> taskDef = new ArrayList<String>() {{
        add("Во сколько раз увеличится площадь поверхности октаэдра, если все его ребра увеличить в 3 раза?");
        add("В правильной треугольной пирамиде SABC сторона основания АВ равна 16, высота SH равна 10.Точка К — середина бокового ребра SA. Плоскость, параллельная плоскости АВС, проходит через точку К и пересекает рёбра SB и SC в точках Q и Р соответственно.\n" +
                "Найдите объём пирамиды KBCPQ, умноженный на √3");
        add("В трапеции ABCD с основаниями ВС и AD углы ABD и ACD прямые.\n" +
                "Найдите AD, если AB = 2, BC = 7.");
        add("Если отпилить у икосаэдра немножко от каждой вершины – сколько будет граней у полученного многогранника?\n" +
                "Назовём его усечённым икосаэдром.");
        add("Прямые, содержащие катеты AC и CB прямоугольного треугольника АСВ, являются общими внутренними касательными к окружностям радиусов 4 и 8. Прямая, содержащая гипотенузу АВ, является их общей внешней касательной.\n" +
                "Найдите площадь треугольника АСВ.");
        add("На стороне BC параллелограмма ABCD выбрана точка M такая, что AM = MC\n" +
                "Найдите радиус вписанной в треугольник AMD окружности, если AB = 7, BC = 21, ∠BAC = 60°");
        add("Во сколько раз увеличится объем правильного тетраэдра, если все его ребра увеличить в два раза?");
        add("От деревянного кубика отпилили все его вершины. Сколько граней у получившегося многогранника?");
        add("В правильной восьмиугольной призме ABCDEFGHA1B1C1D1E1F1G1H1 сторона основания AB равна  а боковое ребро AA1 равно 6. Ha pe6pe CC1 отмечена точка M так, что  Плоскость  параллельна прямой H1E1 и проходит через точки M и A.\n" +
                "Найдите объем пирамиды деленый на 5√2 + 6, вершиной которой является точка F1, а основанием — сечение данной призмы плоскостью α.");
        add("Площадь поверхности куба равна 128. Найдите длину его диагонали.");
        add("В четырёхугольнике ABCD противоположные стороны не параллельны. Диагонали четырёхугольника ABCD пересекаются в точке O под прямым углом и образуют четыре подобных треугольника, у каждого из которых одна из вершин — точка O.\n" +
                "Найдите радиус вписанной окружности, если AC = 10, BD = 26.");
        add("Найти ребро икосаэдра вписанного в октаэдр, если его ребро равно 1");
    }};
    public static List<String> taskImago = new ArrayList<String>() {{
        add("octahedron");
        add("pyramidius");
        add("trapezi");
        add("icosahedron");
        add("circle");
        add("paralelgr");
        add("tetrahedron");
        add("hexahedron");
        add("prism");
        add("cube");
        add("rombi");
        add("dodecahedron");
    }};
    public static List<String> taskFilter = new ArrayList<String>() {{
        add("0358");
        add("037");
        add("135");
        add("03");
        add("1368");
        add("1379");
        add("039");
        add("027");
        add("023489");
        add("04");
        add("167");
        add("03");
    }};
    public static List<String> taskAnswers = new ArrayList<String>() {{
        add("9");
        add("80");
        add("8");
        add("32");
        add("32");
        add("34");
        add("8");
        add("14");
        add("6");
        add("8");
        add("5");
        add("1");
    }};
}